package java_study;

public class Chap02 { 
//	class  클래스를 정의하기 위한 키워드 chap02  클래스 이름 { <-클래스 시작
	public static void main(String[] args) {
		//void 메서드를 실행한 후 변환할 값이 없음을 의미 main 메서드 이름
		System.out.println("안녕, 디지몬"); //<- 실행문은 세미콜론으로 끝남
	} //메서드 끝

} // 클래스 끝

//클래스 객체 지향 언어에서 클래스는 프로그램을 개발하는 단위로 적어도 하나의 클래스가 있어야함
//자바의 소스 파일 이름은 클래스 이름과 연관 클래스 이름은 대문자로 시작하는것이 관례, 클래스 내부에는 여러개의 메서드가 포함 될 수 있다.
//메서드 수행할 작업을 나열한 코드의 모임. 자바 애플리케이션은 main 메서드부터 실행을 시작 main() 메서드를 포함하는 클래스가 반드시있어야한다.
//실행문 작업을 지시하는 변수 선언, 값 저장, 메서드 호출 등의 코드를 의미함 
//주석문 프로그램에 덧붙이는 설명문
//  행 주석 
/*  범위 주석
 */
/** 문서 주석 javadoc.exe명령어로 api 문서를 생성하는데 사용함 */



